timi.org
#+include: back.org
#+TITLE: 天美工作室群(L1)游戏客户端开发实习(已offer)

面试岗位：游戏客户端开发-实习生

* DONE 群面

群面腾讯会议 做题然后提交，总共十来道，C++、算法题、游戏设计题（读代码并给出自己的设计）。
限时1hour。

* DONE 一面
** DONE 已通过

第二天上午再次短信确认了如果通过，能否去成都王者荣耀（否）。然后状态从初试进入了复试（面试官太好了，感谢面试官）。

** DONE 总体感受

CLOSED: <2022-03-16 Thu 20:00-21:45> ~ 80mins

难。尤其是C++，问的很细很深很多，而且都是围绕着实际工程中会遇到的问题。我已经记不起来都问了哪些问题了，只记得一些印象比较深的。总之只死背八股是肯定应付不了的，最好了解一些C++底层的知识（内存、汇编层面、stl源码、C库函数源码、undefined behavior等等）。
天美问了很多为什么，有一些思考性的题，需要根据你已有的知识或者你写项目的经验作出推理判断，并给出原因。因为之前项目里写过汇编，对思考此次面试中的很多指针相关的题目起了很大帮助。


** 基础知识
*** C++(想起多少写多少)
1. 值传参和引用传参的区别？效率有区别吗？
   值传参是在栈上用实参对象构造一个新的对象。引用在栈上存的是一个地址。
   效率上，如果是int/double/float这种内置类型，没有区别。
   如果是自定义class，引用效率高。
2. void*指针能否做算术运算，为什么？
3. void*指针的作用
4. const可以修饰全局函数吗？
5. 常成员函数的作用？
6. 空类大小，继承空基类的子类大小，继续空虚基类的子类大小
7. const全局变量存在.data还是.bss段？
8. const局部变量存在哪？
9. 有没有办法修改const修饰的变量？怎么修改？
10. 构造函数和析构函数能否为虚函数，为什么？
11. new和malloc的区别
12. 空指针、野指针和悬垂指针的区别
13. 空指针（nullptr）是类型还是变量？
14. 宏和模板的区别
15. 模板特化什么用？
16. 模板偏特化
17. 讲讲assert还有static\under{}assert
18. 讲讲左值和右值
19. 讲讲移动语义
20. const T &可以接受右值吗？
21. 四种智能指针
22. 你用过哪种智能指针
23. 怎样判断类型A转换到类型B是安全的？实现上可以直接转换吗？
24. dynamic\under{}cast转换都会成功吗？
25. dynamic\under{}cast是怎样判断当前下行转换是否安全的？
26. 不借助库函数，如何判断大小端
27. 哪些场景下我们需要注意大小端？
28. 讲讲你常用的排序算法的复杂度和稳定性
29. quick sort什么时候退化成O(n^2)
30. std::sort的代码看过吗，是怎么实现的?(SGI版本的STL是introsort+insertion\under{}sort，总之非常复杂。稳定性方面sort不稳定，stable\under{}sort是稳定的)
31. 内存对齐的作用？
32. 讲讲多态
33. 动态链接库和静态链接库的区别
34. 动态库和静态库在模块覆盖上的灵活度谁好？
35. 构建一个静态链接库可以用到动态链接库吗？如果可以，构建好的静态库需要携带动态库吗？
    反之又如何呢？
36. long/int/double/float这些内置类型的size。他们一定是固定的吗？比如int一定是4字节吗？
37. int和uint的二进制表示，每一位的含义
38. 浮点数的二进制表示的每一位含义你熟悉吗？
39. 你常用的stl容器
40. 数组和链表的区别
41. map和unordered\under{}map的效率
42. map的底层
43. 红黑树原理
44. unordered\under{}map的底层
45. stl的hashtable怎么解决冲突？
46. 讲讲开链法
47. volatile的作用
48. 说一下纯虚函数和抽象类
49. 仿函数
50. 讲讲拷贝构造函数和operator=()
51. memcpy和memmove的区别
52. 说说内存屏障（表示没听过，我就说了句和同步有关。内存屏障和内存序、CPU乱序执行有关）

*** 计网（问的很少）
1. TCP和UDP区别
2. TCP的三次握手
3. DNS是什么
4. DNS请求过程
5. SQL注入是什么
6. 怎么避免SQL注入？


*** 操作系统
1. 进程和线程区别（老朋友）
2. 互斥锁和自旋锁
3. 忘了还有啥了


*** 设计模式
1. 单例模式如何实现？
2. 简述工厂模式

*** 算法题
1. 合并K个有序链表（口述）

*** 游戏相关
我说了我图形学0基础，所以面试官问了个基础的问题，偏数学。
1. 三角形有正反面之分，现在一次给你一个三角形的a, b, c三个顶点的坐标，你如何判断a,b,c的顺序是顺时针还是逆时针，提示：可以从向量角度思考？

   应该是判断(b-c)和(a-c)的叉积与三角形正面的方向是否一致。

2. 你都玩什么游戏？
   
** 项目
1. 指针角度识别，你遇到的困难是什么？
2. 你是怎样二值化的？你了解哪些二值化方法？你知道你用的二值化库函数是怎么实现的吗？
3. 你收获最大的项目（协程库）
4. 你是怎么实现无栈协程的？（struct + Duff's device + 宏）
5. 你觉得你的项目的不足？（不够优雅，不够易用，不够规范）

** 反问
1. 我感觉这次面试问的很深很细，挺难的。
   面试官说大部分题答得还不错，就是比较好奇为什么我别的题答了，但是不清楚为什么别人写的指针占4B，自己测试是8B。我解释说我知道是因为平台和OS的原因，是困惑那些写八股的人为什么不写清楚。面试官表示理解。
2. 游戏客户端开发的岗位需要和图形学打交道吗？
3. （面试官：你的意向地是深圳，我们是天美成都，如果通过了你能来成都吗？）
4. 我刚刚说没法去成都，会影响面试结果吗？


* DONE 二面

CLOSED: <2022-03-22 Tue 19:50> ~40min

** 基础知识
*** C++
1. C++构造和析构函数里throw会有什么问题？
2. 如果现在有一个类在析构的时候可能throw，你怎样设计能保证正确析构并释放内存？
3. C++11/14新特性，你常用的有哪些？
4. 讲一下万能引用和完美转发
*** 计网
1. TCP粘包问题的原因和解决方法
2. Nagle算法
3. 你怎么设计一个可靠且报文有序的UDP协议？
4. 滑动窗口讲一下
*** OS没有问
*** 游戏相关
1. 讲讲游戏里的同步机制（决策同步、网络同步）
2. 玩过王者荣耀吗？你觉得王者荣耀涉及到的一些技术？
3. 或者说你讲讲你玩游戏的时候，有没有从技术的角度思考过实现上的一些问题？

** 其它
1. 如果通过，能来成都王者荣耀吗？
2. 麻将BOT项目
3. 你写的项目大多是个人项目还是课程作业？
4. 面试官看过我协程库里的一个类的代码，给我提了一些建议。
5. 反问：游戏0基础会不会影响面试结果呢？ 肯定占一定比重，但是会综合考量。
6. 反问：如果通过本轮面试，下一轮是成都还是深圳的来面我呢？ 成都或者回简历池
7. 反问：我所欠缺或者亟需学习的地方？ 当然是游戏，还有引擎例如unity也要学，然后就是项目实现不够好，性能可以继续优化。


* DONE 三面

CLOSED: <2022-03-29 Tue> ~1hour

三面着重问了项目。

** 基础知识
*** C++
1. 学校里关于C++的课程。（c++、算法数据结构、各门课程设计）
2. 你对C++特性的学习和理解。（我对c++感触最深的是1.裸指针、2.OOP、3.泛型）
3. 智能指针
4. shared\under{}ptr的count的存放位置

** 项目
对着代码讲，问的很细
*** 协程库
1. 讲讲设计思想
2. 无栈协程的实现思路
3. 对着无栈协程的代码将各部分在干什么，各个变量的用处。
4. 如何定义无栈协程，如何await，如何回到上次执行的位置。
5. 有栈协程struct的定义，主要变量的含义
6. 对着汇编代码，讲在干什么，哪个函数实现协程的切换。
7. 有栈协程的调度是怎么做的


*** Lisp解释器
1. Lisp解释器的实现思路（解析前缀表达式，返回类型是多样的，泛型怎么做的）
2. C++版本的实现，泛型通过一个结构体里记录value_type，然后用union实现转换
3. Rust版本的实现，支持了lambda表达式，怎么判断lambda函数体里用的变量是外部定义的还是内部的。
4. 借助Rust的枚举实现了泛型。

*** 虚拟文件系统
1. 设计思想（大致是将底层细节屏蔽，抽象成统一接口）
2. 文件在磁盘上的存放，是怎样设计的。
3. 是连续存放的吗？
4. inode所管理的磁盘块号你是用链表还是数组实现的
5. 用户传入要打开的文件路径，如果文件数量很多，你怎么快速找到要打开的文件所属的inode？
6. 你的设计考虑到磁盘碎片的整理了吗？


** 反问
1. 后面还有技术面吗？
2. 我现在面的组，图形学用的多吗？
3. 工作用的语言
4. 为什么很看中对底层的了解？


* DONE HR面

CLOSED: <2022-04-02 Sat> ~50min

聊了学习习惯、性格等，问了是否有亲属在腾讯等。

确认了一下是天美L1王者荣耀本组。

听说腾讯现在没什么实习hc，很多人卡在HR面后、录用评估阶段或者HR不约面，不少人已经等了一两个周甚至三个周了，最近三周基本没人收到OC。

<2022-04-26> 更新：已offer，天美L1
