timi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-15 Wed 15:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>天美工作室群(L1)游戏客户端开发实习(已offer)</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">天美工作室群(L1)游戏客户端开发实习(已offer)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb92317a">1. <span class="done DONE">DONE</span> 群面</a></li>
<li><a href="#org2772a9a">2. <span class="done DONE">DONE</span> 一面</a>
<ul>
<li><a href="#org35be42b">2.1. <span class="done DONE">DONE</span> 已通过</a></li>
<li><a href="#org6e16339">2.2. <span class="done DONE">DONE</span> 总体感受</a></li>
<li><a href="#org5bfead4">2.3. 基础知识</a>
<ul>
<li><a href="#orga8598ba">2.3.1. C++(想起多少写多少)</a></li>
<li><a href="#orgfce09c4">2.3.2. 计网（问的很少）</a></li>
<li><a href="#org276e540">2.3.3. 操作系统</a></li>
<li><a href="#org51496bb">2.3.4. 设计模式</a></li>
<li><a href="#orgd6609f0">2.3.5. 算法题</a></li>
<li><a href="#org2eac92b">2.3.6. 游戏相关</a></li>
</ul>
</li>
<li><a href="#org5968dba">2.4. 项目</a></li>
<li><a href="#orgf35c38f">2.5. 反问</a></li>
</ul>
</li>
<li><a href="#org2bf1098">3. <span class="done DONE">DONE</span> 二面</a>
<ul>
<li><a href="#org5ab9bb1">3.1. 基础知识</a>
<ul>
<li><a href="#org6e5173b">3.1.1. C++</a></li>
<li><a href="#orge23b523">3.1.2. 计网</a></li>
<li><a href="#org8d0f1fd">3.1.3. OS没有问</a></li>
<li><a href="#orgfc17def">3.1.4. 游戏相关</a></li>
</ul>
</li>
<li><a href="#org90ba1bb">3.2. 其它</a></li>
</ul>
</li>
<li><a href="#org1015cb3">4. <span class="done DONE">DONE</span> 三面</a>
<ul>
<li><a href="#org02c9e60">4.1. 基础知识</a>
<ul>
<li><a href="#org156117f">4.1.1. C++</a></li>
</ul>
</li>
<li><a href="#orgb8c7ed2">4.2. 项目</a>
<ul>
<li><a href="#org4811ff7">4.2.1. 协程库</a></li>
<li><a href="#orgcbce0e7">4.2.2. Lisp解释器</a></li>
<li><a href="#org1f977c1">4.2.3. 虚拟文件系统</a></li>
</ul>
</li>
<li><a href="#org24f82e1">4.3. 反问</a></li>
</ul>
</li>
<li><a href="#org5433a53">5. <span class="done DONE">DONE</span> HR面</a></li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>
<p>
面试岗位：游戏客户端开发-实习生
</p>

<div id="outline-container-orgb92317a" class="outline-2">
<h2 id="orgb92317a"><span class="section-number-2">1.</span> <span class="done DONE">DONE</span> 群面</h2>
<div class="outline-text-2" id="text-1">
<p>
群面腾讯会议 做题然后提交，总共十来道，C++、算法题、游戏设计题（读代码并给出自己的设计）。
限时1hour。
</p>
</div>
</div>

<div id="outline-container-org2772a9a" class="outline-2">
<h2 id="org2772a9a"><span class="section-number-2">2.</span> <span class="done DONE">DONE</span> 一面</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org35be42b" class="outline-3">
<h3 id="org35be42b"><span class="section-number-3">2.1.</span> <span class="done DONE">DONE</span> 已通过</h3>
<div class="outline-text-3" id="text-2-1">
<p>
第二天上午再次短信确认了如果通过，能否去成都王者荣耀（否）。然后状态从初试进入了复试（面试官太好了，感谢面试官）。
</p>
</div>
</div>

<div id="outline-container-org6e16339" class="outline-3">
<h3 id="org6e16339"><span class="section-number-3">2.2.</span> <span class="done DONE">DONE</span> 总体感受</h3>
<div class="outline-text-3" id="text-2-2">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-16 Wed 20:00&gt;&#x2013;&lt;2022-03-16 Wed 21:45&gt; </span></span> ~ 80mins
</p>

<p>
难。尤其是C++，问的很细很深很多，而且都是围绕着实际工程中会遇到的问题。我已经记不起来都问了哪些问题了，只记得一些印象比较深的。总之只死背八股是肯定应付不了的，最好了解一些C++底层的知识（内存、汇编层面、stl源码、C库函数源码、undefined behavior等等）。
天美问了很多为什么，有一些思考性的题，需要根据你已有的知识或者你写项目的经验作出推理判断，并给出原因。因为之前项目里写过汇编，对思考此次面试中的很多指针相关的题目起了很大帮助。
</p>
</div>
</div>


<div id="outline-container-org5bfead4" class="outline-3">
<h3 id="org5bfead4"><span class="section-number-3">2.3.</span> 基础知识</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orga8598ba" class="outline-4">
<h4 id="orga8598ba"><span class="section-number-4">2.3.1.</span> C++(想起多少写多少)</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>值传参和引用传参的区别？效率有区别吗？
值传参是在栈上用实参对象构造一个新的对象。引用在栈上存的是一个地址。
效率上，如果是int/double/float这种内置类型，没有区别。
如果是自定义class，引用效率高。</li>
<li>void*指针能否做算术运算，为什么？</li>
<li>void*指针的作用</li>
<li>const可以修饰全局函数吗？</li>
<li>常成员函数的作用？</li>
<li>空类大小，继承空基类的子类大小，继续空虚基类的子类大小</li>
<li>const全局变量存在.data还是.bss段？</li>
<li>const局部变量存在哪？</li>
<li>有没有办法修改const修饰的变量？怎么修改？</li>
<li>构造函数和析构函数能否为虚函数，为什么？</li>
<li>new和malloc的区别</li>
<li>空指针、野指针和悬垂指针的区别</li>
<li>空指针（nullptr）是类型还是变量？</li>
<li>宏和模板的区别</li>
<li>模板特化什么用？</li>
<li>模板偏特化</li>
<li>讲讲assert还有static_assert</li>
<li>讲讲左值和右值</li>
<li>讲讲移动语义</li>
<li>const T &amp;可以接受右值吗？</li>
<li>四种智能指针</li>
<li>你用过哪种智能指针</li>
<li>怎样判断类型A转换到类型B是安全的？实现上可以直接转换吗？</li>
<li>dynamic_cast转换都会成功吗？</li>
<li>dynamic_cast是怎样判断当前下行转换是否安全的？</li>
<li>不借助库函数，如何判断大小端</li>
<li>哪些场景下我们需要注意大小端？</li>
<li>讲讲你常用的排序算法的复杂度和稳定性</li>
<li>quick sort什么时候退化成O(n<sup>2</sup>)</li>
<li>std::sort的代码看过吗，是怎么实现的?(SGI版本的STL是introsort+insertion_sort，总之非常复杂。稳定性方面sort不稳定，stable_sort是稳定的)</li>
<li>内存对齐的作用？</li>
<li>讲讲多态</li>
<li>动态链接库和静态链接库的区别</li>
<li>动态库和静态库在模块覆盖上的灵活度谁好？</li>
<li>构建一个静态链接库可以用到动态链接库吗？如果可以，构建好的静态库需要携带动态库吗？
反之又如何呢？</li>
<li>long/int/double/float这些内置类型的size。他们一定是固定的吗？比如int一定是4字节吗？</li>
<li>int和uint的二进制表示，每一位的含义</li>
<li>浮点数的二进制表示的每一位含义你熟悉吗？</li>
<li>你常用的stl容器</li>
<li>数组和链表的区别</li>
<li>map和unordered_map的效率</li>
<li>map的底层</li>
<li>红黑树原理</li>
<li>unordered_map的底层</li>
<li>stl的hashtable怎么解决冲突？</li>
<li>讲讲开链法</li>
<li>volatile的作用</li>
<li>说一下纯虚函数和抽象类</li>
<li>仿函数</li>
<li>讲讲拷贝构造函数和operator=()</li>
<li>memcpy和memmove的区别</li>
<li>说说内存屏障（表示没听过，我就说了句和同步有关。内存屏障和内存序、CPU乱序执行有关）</li>
</ol>
</div>
</div>

<div id="outline-container-orgfce09c4" class="outline-4">
<h4 id="orgfce09c4"><span class="section-number-4">2.3.2.</span> 计网（问的很少）</h4>
<div class="outline-text-4" id="text-2-3-2">
<ol class="org-ol">
<li>TCP和UDP区别</li>
<li>TCP的三次握手</li>
<li>DNS是什么</li>
<li>DNS请求过程</li>
<li>SQL注入是什么</li>
<li>怎么避免SQL注入？</li>
</ol>
</div>
</div>


<div id="outline-container-org276e540" class="outline-4">
<h4 id="org276e540"><span class="section-number-4">2.3.3.</span> 操作系统</h4>
<div class="outline-text-4" id="text-2-3-3">
<ol class="org-ol">
<li>进程和线程区别（老朋友）</li>
<li>互斥锁和自旋锁</li>
<li>忘了还有啥了</li>
</ol>
</div>
</div>


<div id="outline-container-org51496bb" class="outline-4">
<h4 id="org51496bb"><span class="section-number-4">2.3.4.</span> 设计模式</h4>
<div class="outline-text-4" id="text-2-3-4">
<ol class="org-ol">
<li>单例模式如何实现？</li>
<li>简述工厂模式</li>
</ol>
</div>
</div>

<div id="outline-container-orgd6609f0" class="outline-4">
<h4 id="orgd6609f0"><span class="section-number-4">2.3.5.</span> 算法题</h4>
<div class="outline-text-4" id="text-2-3-5">
<ol class="org-ol">
<li>合并K个有序链表（口述）</li>
</ol>
</div>
</div>

<div id="outline-container-org2eac92b" class="outline-4">
<h4 id="org2eac92b"><span class="section-number-4">2.3.6.</span> 游戏相关</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
我说了我图形学0基础，所以面试官问了个基础的问题，偏数学。
</p>
<ol class="org-ol">
<li><p>
三角形有正反面之分，现在一次给你一个三角形的a, b, c三个顶点的坐标，你如何判断a,b,c的顺序是顺时针还是逆时针，提示：可以从向量角度思考？
</p>

<p>
应该是判断(b-c)和(a-c)的叉积与三角形正面的方向是否一致。
</p></li>

<li>你都玩什么游戏？</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5968dba" class="outline-3">
<h3 id="org5968dba"><span class="section-number-3">2.4.</span> 项目</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>指针角度识别，你遇到的困难是什么？</li>
<li>你是怎样二值化的？你了解哪些二值化方法？你知道你用的二值化库函数是怎么实现的吗？</li>
<li>你收获最大的项目（协程库）</li>
<li>你是怎么实现无栈协程的？（struct + Duff's device + 宏）</li>
<li>你觉得你的项目的不足？（不够优雅，不够易用，不够规范）</li>
</ol>
</div>
</div>

<div id="outline-container-orgf35c38f" class="outline-3">
<h3 id="orgf35c38f"><span class="section-number-3">2.5.</span> 反问</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>我感觉这次面试问的很深很细，挺难的。
面试官说大部分题答得还不错，就是比较好奇为什么我别的题答了，但是不清楚为什么别人写的指针占4B，自己测试是8B。我解释说我知道是因为平台和OS的原因，是困惑那些写八股的人为什么不写清楚。面试官表示理解。</li>
<li>游戏客户端开发的岗位需要和图形学打交道吗？</li>
<li>（面试官：你的意向地是深圳，我们是天美成都，如果通过了你能来成都吗？）</li>
<li>我刚刚说没法去成都，会影响面试结果吗？</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org2bf1098" class="outline-2">
<h2 id="org2bf1098"><span class="section-number-2">3.</span> <span class="done DONE">DONE</span> 二面</h2>
<div class="outline-text-2" id="text-3">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-22 Tue 19:50&gt; </span></span> ~40min
</p>
</div>

<div id="outline-container-org5ab9bb1" class="outline-3">
<h3 id="org5ab9bb1"><span class="section-number-3">3.1.</span> 基础知识</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org6e5173b" class="outline-4">
<h4 id="org6e5173b"><span class="section-number-4">3.1.1.</span> C++</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>C++构造和析构函数里throw会有什么问题？</li>
<li>如果现在有一个类在析构的时候可能throw，你怎样设计能保证正确析构并释放内存？</li>
<li>C++11/14新特性，你常用的有哪些？</li>
<li>讲一下万能引用和完美转发</li>
</ol>
</div>
</div>
<div id="outline-container-orge23b523" class="outline-4">
<h4 id="orge23b523"><span class="section-number-4">3.1.2.</span> 计网</h4>
<div class="outline-text-4" id="text-3-1-2">
<ol class="org-ol">
<li>TCP粘包问题的原因和解决方法</li>
<li>Nagle算法</li>
<li>你怎么设计一个可靠且报文有序的UDP协议？</li>
<li>滑动窗口讲一下</li>
</ol>
</div>
</div>
<div id="outline-container-org8d0f1fd" class="outline-4">
<h4 id="org8d0f1fd"><span class="section-number-4">3.1.3.</span> OS没有问</h4>
</div>
<div id="outline-container-orgfc17def" class="outline-4">
<h4 id="orgfc17def"><span class="section-number-4">3.1.4.</span> 游戏相关</h4>
<div class="outline-text-4" id="text-3-1-4">
<ol class="org-ol">
<li>讲讲游戏里的同步机制（决策同步、网络同步）</li>
<li>玩过王者荣耀吗？你觉得王者荣耀涉及到的一些技术？</li>
<li>或者说你讲讲你玩游戏的时候，有没有从技术的角度思考过实现上的一些问题？</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org90ba1bb" class="outline-3">
<h3 id="org90ba1bb"><span class="section-number-3">3.2.</span> 其它</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>如果通过，能来成都王者荣耀吗？</li>
<li>麻将BOT项目</li>
<li>你写的项目大多是个人项目还是课程作业？</li>
<li>面试官看过我协程库里的一个类的代码，给我提了一些建议。</li>
<li>反问：游戏0基础会不会影响面试结果呢？ 肯定占一定比重，但是会综合考量。</li>
<li>反问：如果通过本轮面试，下一轮是成都还是深圳的来面我呢？ 成都或者回简历池</li>
<li>反问：我所欠缺或者亟需学习的地方？ 当然是游戏，还有引擎例如unity也要学，然后就是项目实现不够好，性能可以继续优化。</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org1015cb3" class="outline-2">
<h2 id="org1015cb3"><span class="section-number-2">4.</span> <span class="done DONE">DONE</span> 三面</h2>
<div class="outline-text-2" id="text-4">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-29 Tue&gt; </span></span> ~1hour
</p>

<p>
三面着重问了项目。
</p>
</div>

<div id="outline-container-org02c9e60" class="outline-3">
<h3 id="org02c9e60"><span class="section-number-3">4.1.</span> 基础知识</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org156117f" class="outline-4">
<h4 id="org156117f"><span class="section-number-4">4.1.1.</span> C++</h4>
<div class="outline-text-4" id="text-4-1-1">
<ol class="org-ol">
<li>学校里关于C++的课程。（c++、算法数据结构、各门课程设计）</li>
<li>你对C++特性的学习和理解。（我对c++感触最深的是1.裸指针、2.OOP、3.泛型）</li>
<li>智能指针</li>
<li>shared_ptr的count的存放位置</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb8c7ed2" class="outline-3">
<h3 id="orgb8c7ed2"><span class="section-number-3">4.2.</span> 项目</h3>
<div class="outline-text-3" id="text-4-2">
<p>
对着代码讲，问的很细
</p>
</div>
<div id="outline-container-org4811ff7" class="outline-4">
<h4 id="org4811ff7"><span class="section-number-4">4.2.1.</span> 协程库</h4>
<div class="outline-text-4" id="text-4-2-1">
<ol class="org-ol">
<li>讲讲设计思想</li>
<li>无栈协程的实现思路</li>
<li>对着无栈协程的代码将各部分在干什么，各个变量的用处。</li>
<li>如何定义无栈协程，如何await，如何回到上次执行的位置。</li>
<li>有栈协程struct的定义，主要变量的含义</li>
<li>对着汇编代码，讲在干什么，哪个函数实现协程的切换。</li>
<li>有栈协程的调度是怎么做的</li>
</ol>
</div>
</div>


<div id="outline-container-orgcbce0e7" class="outline-4">
<h4 id="orgcbce0e7"><span class="section-number-4">4.2.2.</span> Lisp解释器</h4>
<div class="outline-text-4" id="text-4-2-2">
<ol class="org-ol">
<li>Lisp解释器的实现思路（解析前缀表达式，返回类型是多样的，泛型怎么做的）</li>
<li>C++版本的实现，泛型通过一个结构体里记录value<sub>type</sub>，然后用union实现转换</li>
<li>Rust版本的实现，支持了lambda表达式，怎么判断lambda函数体里用的变量是外部定义的还是内部的。</li>
<li>借助Rust的枚举实现了泛型。</li>
</ol>
</div>
</div>

<div id="outline-container-org1f977c1" class="outline-4">
<h4 id="org1f977c1"><span class="section-number-4">4.2.3.</span> 虚拟文件系统</h4>
<div class="outline-text-4" id="text-4-2-3">
<ol class="org-ol">
<li>设计思想（大致是将底层细节屏蔽，抽象成统一接口）</li>
<li>文件在磁盘上的存放，是怎样设计的。</li>
<li>是连续存放的吗？</li>
<li>inode所管理的磁盘块号你是用链表还是数组实现的</li>
<li>用户传入要打开的文件路径，如果文件数量很多，你怎么快速找到要打开的文件所属的inode？</li>
<li>你的设计考虑到磁盘碎片的整理了吗？</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org24f82e1" class="outline-3">
<h3 id="org24f82e1"><span class="section-number-3">4.3.</span> 反问</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>后面还有技术面吗？</li>
<li>我现在面的组，图形学用的多吗？</li>
<li>工作用的语言</li>
<li>为什么很看中对底层的了解？</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org5433a53" class="outline-2">
<h2 id="org5433a53"><span class="section-number-2">5.</span> <span class="done DONE">DONE</span> HR面</h2>
<div class="outline-text-2" id="text-5">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-02 Sat&gt; </span></span> ~50min
</p>

<p>
聊了学习习惯、性格等，问了是否有亲属在腾讯等。
</p>

<p>
确认了一下是天美L1王者荣耀本组。
</p>

<p>
听说腾讯现在没什么实习hc，很多人卡在HR面后、录用评估阶段或者HR不约面，不少人已经等了一两个周甚至三个周了，最近三周基本没人收到OC。
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-26 Tue&gt; </span></span> 更新：已offer，天美L1
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-03-15 Wed 15:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
